package textpreprocessing;

import java.awt.BorderLayout;
import java.sql.Connection;
import java.sql.DriverManager;
import java.sql.ResultSet;
import java.sql.SQLException;
import java.sql.Statement;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.HashSet;
import java.util.List;
import java.util.Set;
import java.util.regex.Matcher;

/**
 *
 * @author user
 */
public class StopwordRemoval {
    
    
    private static final String [] AMHARIC_STOPWORD = {"﻿ይኼ","ሆነም","አፅድቆታል","አይከትም","እስክ","ያወሳል","ይስማሙበታል",
"ምሳል","ያሳያል","መሆኑም","ምናልባትም","ይገምታል","ያነሳል","ይጠቅሳል",
"ከፍተኝ","ተረጋግ","ይተነብያል","ይቻላል","ያምናል","ያሳስባል","ተስፍ","ሪፖርተር",
"ኃላፍ","ተጠየቅ","ይገባል","ዘም","አስረድቷል","አስታውሷል","ዚህ",
"መግለጭ","ተካቷል","ተብራርቷል","ተመልክቷል","አስተላልፏል","ተፈቀድ","ተጫውታል",
"ትገኛል","አድርጋል","ተጫዋታል","ይገኛል","ቀጥፏል","ተፈጥሯል","ይታያል",
"ተቀይረዋል","ተስተጓጉሏል","ጠፍቷል","ተገትቷል","አጋጥሟል","ትፈልጋል","ገብታል",
"ትኮንናል","ይከራከራል","ብል","ይጠቀምብሃል","ሆናል","ያባብሱታል","ይኼ",
"ኖርን","አለብ","ሁለት","አመራር","አጠናቋል","ጠናቀቅ","ምሥረት",
"ጀምሯል","ተካሄድ","ተቀመጥ","አውስቷል","ተተክ","ያደርጋል","ካቲት",
"ሸኝቷል","ሰንብቷል","አስተባብሯል","ተናፈስ","ተስተውለዋል","ወደብ","አብራርቷል",
"አንፀባርቀዋል","ርበር","ይጠቁማል","ተሰናበት","ይሆናል","ይሠራሉም","ይግ",
"ያገለግላል","ተችተዋቸዋል","ተወስቷል","ይተቻል","ጆርጅ","ተገኝቷል","ገዥ",
"ስብሰብ","ያቀርባል","ተዘርዝሯል","ይመርጣል","ባለፍ","ተበተን","ታወቁት",
"ተደንግጓል","አልተያዘም","ሁም","ያሳስበዋል","በተለያይ","እስከዛር","አልሆነም",
"አድርጎታል","ደርሰዋል","ቀሩት","አዋጅ","አንድ","ሸሽተዋል","ተገድደዋል",
"ተሰደዋል","እሳች","ገለጽ","ተበሩት","አሰምተዋል","ተሰናብተዋል","ብሏቸዋል",
"ተብለዋል","አክሏል","ዓቃብ","አስፍሯል","አስጠነቀቅ","አስጠንቅቋል","መልሷል",
"አላገኙም","ተሰጥቷል","ይደረጋል","አድንቀዋል","ተፈት","ተለቋል","ተቃጥለዋል",
"አወዛጋብ","ሰጥተውታል","ፈጅቷል","መክረዋል","ዝግ","ገነዘባል","አላብራሩም",
"ግፋል","ዶ/ር","ያመላክታል","ተስማምተዋል","ተፈጽሟል","ሰንብታል","አሥር",
"አልተገኘም","አውጇል","ተዘግተዋል","ተቋርጧል","ሆኗል","አይስማሙም","መጥታል",
"ደርሳል","ታደርጋል","ምንል","ያተኩራል","ይፈልጋል","ሰምተናል","ይመጣል",
"መብት","ክትትል","ማናቸውንም","አሁን","ሰብሳብ","አካቷል","አልቀረበም",
"ተደርገዋል","ተዘጋጅቷል","ይኖርበታል","ተጠርተዋል","ይህ","ይስተዋላል","ተደርሷል",
"አልበረደም","አስከትሏል","ሞተዋል","አወጥ","ሰፍኗል","አስተለፍ","ዓም",
"ልዩነታች","መጀመርይ","ይገኝበታል","አስታወቅ","አለፉም","አጠናቀዋል","ሌል",
"ገምግሟል","አውጥቷል","ቀጥለዋል","አድረዋል","ብአድ","አስተማሪነት","አናስብም",
"ይመራል","አት","ወስነናል","አያምኑም","ይሾማል","ይሰጣቸዋል","ይሰማል",
"ይደነግጋል","ሰሞን","ያካሂዳል","አትቷል","አራት","አምስት","ሰባት",
"ይወደራል","መርጧቸዋል","ማብራሪይ","ተቃውመዋል","ቀረቡት","አልተቀበሉትም","ተገብቷል",
"ድምፅ","ተመልሰዋል","ሰላስ","ተቆጥረዋል","ተጥሏል","ይዟል","ያውላል",
"ይቋቋማል","ተገደዋል","አይገምቱም","ችል","ተጀምሯል","ጽፈናል","ሞግተዋል",
"መልሳት","አሉብ","ተከራክረዋል","ይጠይቃል","አላየሁም","አልሰማሁም","አህ",
"ዘርዝረዋል","አላሰማም","ተሰጥታል","ሠጋል","መጨረሻም","ነግረዋቸዋል","ይቀጥላል",
"ከሰኝ","ነግረዋል","አውጥተዋል","ተቃውማል","ተቃውሞታል","ተቃውሟል","ተዘግቷል",
"መጥተዋል","ተቋርጠዋልታንታለም","ተያያዝ","አደርጓል","ሪፖርት","ትናገራል","ታስታውሳል",
"ታስረዳል","ባለፉት","ትገልጻል","ታስረድታል","አስገብተዋል","አልችልም","አናስታውስም",
"አይመጣም","አይኖርም","አይመስለኝም","ይኖራል","ማይቻል","ነበር","ሆኗልም",
"ከሁል","አይችልም","ይኖርብናል","ተንፀባርቀዋል","አላቆሙም","ያቀረቡት","ያሰፋል",
"አንፈልግም","አልታየም","ቀጥል","ተቋረጥ","ርሟል","እስር","ነኝ",
"አያውቅም","ተቀይሯል","አምኗል","ያደንቅለታል","ይወስዳል","አጠቃላይ","ተርዟል",
"ታዝቧል","ትናንት","ቆሟል","ተቃጥሏል","ይሰነብታል","ፍቱል","ከጅም",
"ተጠቅሟል","አድርገናል","ጋምቤል","አሳልፋል","መደበኝ","ተፈጠር","አሰል",
"ገጥሟል","አስተለፈዋል","ተነስ","ስምምነት","ሰፍሯል","ወረድ","ይሸፍናል",
"ይዋሰናል","አጥተዋል","ይጠቀሳል","ተንት","አስምሮበታል","አስተሰብ","ውስጥ",
"ይቋረጣል","ቆጠር","የት","ተፈቅዶላቸዋል","ተካሂዷል","ተዘጉት","ይለቃል",
"አልተጠቀሙበትም","ቀበላቸዋል","ሁለቱም","ጉባዔ","ተለይተዋል","ተለቀቅ","ተለቀዋል",
"ቢል","ጥያቅ","ተቋርጥ","ሃምስ","እምነበረድ","ይፈቀድላቸዋል","ከጎድ",
"መረት","ነን","ተዛብቷል","ይፈጥራል","አምነዋል","ይሠራል","ነግረውናል",
"ይገለጻል","አካሂዷል","ያሳልፋል","ካለፉት","ወራት","ቀድሞውም","ይሰጣል",
"አይችሉም","ይላል","አሳለፍ","ተቋቁሟል","አስገኝቷል","ሰጥተዋቸዋል","ቆዩት",
"ብለውታል","ይሰማበታል","ተሰምሮበታል","ተመላክቷል","ይዘረዝራል","አፍርሰናል","እወስዳል",
"እናርማል","አረጋግጧል","ሰጥቶኛል","አልሄድም","እቆጠረዋል","ተቸግራል","ይከፍታል",
"ተናገረዋል","አልጠቆሙም","አሰኝቷል","እስካሁንም","ወቅሰዋል","ላቸውም","ይውላል",
"መጥቷል","ተወሰን","ላትም","ይገጥሙናል","ተፈራርመዋል","ዘለቅ","አውግዟል",
"ምክንያታች","አያስከትልም","አስይዟል","ተንትኗል","አድርገውለታል","ዘግበዋል","አልተጀመረም",
"ቻሉት","መርተውታል","ተመዝግበዋል","አስገንዝበዋል","ማጠቃለይ","መዝጊይ","ሸጦታል",
"ይናገራል","ፕል","አስቁሟል","ቋም","መድቧል","አቀረብ","ነው",
"አቅርበዋል","አሳስቧል","አቅርቧል","አድርገዋል","ተገልጿል","አስታውቀዋል","ከዝ",
"ጠቁመዋል","ተናግረዋል","ሰጥተዋል","ተደርጓል","ተችሏል","ታውቋል","ወ/ር",
"ገልጸዋል","አረጋግጠዋል","አስረድተዋል","አክለዋል","ውጭ","ያመለክታል","ብሏል",
"ጠቁሟል","ተጠቁሟል","ተጠቅሷል","አስታውቋል","አንስተዋል","ይችላል","አድርጓል",
"ተካተዋል","ቀርተዋል","ይታወቃል","ይታወሳል","ይነገራል","አልተሳካም","ተስተውሏል",
"አይዘነጋም","አልተቻለም","ይስማማል","አስታውሰዋል","ቀድም","ይመስለኛል","ተደምጧል",
"ቆይተዋል","ይገልጻል","አልቻለም","ተመሳሳይ","አይደለም","ዘግቧል","አሳስበዋል",
"አሳልፏል","ተናግሯል","ተመሠረት","ያብራራል","ቀርቷል","ተፈትተዋል","መቀጠልም",
"ተሰምቷል","ገጥሟቸዋል","ታይተዋል","አስተላልፈዋል","ተከስተዋል","ተዳርገዋል","ተፈናቅለዋል",
"አመልክተዋል","አስቆጥሯል","ተደምጠዋል","ነገር","አውስተዋል","ቀርቧል","እን",
"ተወስኗል","ጠይቀዋል","አመልክቷል","ተጠቆም","ይጠበቃል","ዋን","አስፍረዋል",
"ቀደም","አልታወቀም","ጠቅሰዋል","ቀርበዋል","ነች","ጠይቋል","ቆይቷል",
"አራተኝ","ይመስላል","ይመለከታል","አግኝተዋል","ተጨማሪም","ተረጋግጧል","ተቆጥበዋል",
"አብራርተዋል","አገልግለዋል","አንዳንድ","ዳሰዋል","አልተገኙም","አይታወቅም","ተችተዋል",
"ደርሶበታል","ተለይም","ሁለተኝ","ሦስተኝ","ያክላል","ታይቷል","ተጠናቋል",
"ተገለጽ","ይገኙበታል","አንደኛውም","ይዘወራል","ታጣል","ይወክላል","ይሞክራል",
"አልፈቀዱም","አልደረሱም","አላገኘም","ቀርታል","ተወያይተዋል","አልጀመሩም","ያጋጠም",
"ተጀመር","ደርሶባቸዋል","ጋይተዋል","ወድመዋል","አሁንም","አልሰጠንም","አይኖርምም",
"ፈቅዷል","አሳይተዋል","አላውቅም","አይነካቸውም","ተከስት","ውክል","ፍተዋል",
"ሰጥቷቸዋል","አይደሉም","አጣጥለውታል","አትችልም","አይቻልም","አለፍ","ተጠቅመዋል",
"ይካሄዳል","ተሳትፈዋል","ተልከዋል","ተምራል","አመለከት","አልተጠናቀቀም","ቆይታል",
"አልቻሉም","አድርጋዋል","አይቀበሉትም","ተጨማር","ተጥሎባቸዋል","ተደግፏል","ሆኖም",
"አልነበረውም","ተገምግሟል","አሉት","አሳይቷል","አገልግሎት","አልነበረም","ባይሆንም",
"አላስብም","አይኖረውም","ወስደዋል","አልነበሩም","ይከሳል","ያሉት","ገጥሞታል",
"ያሠጋል","ይህንን","አድርገውላቸዋል","አትገባም","ተዘግቧል","አንፈቅድም","አይቀርብም",
"አይድኑም","አረጋጋጠዋል","ሆነዋል","ወስዷል","አደረግ","አድርጓቸዋል","ተደራዳር",
"ባቸውም","ከፀር","ይቀርባል","ቀምጣል","ሻሻል","ሰንዝረዋል","አስተባብለዋል",
"አሳስባል","ያከራዩታል","ይመሠርታል","ተላልፋል","አስቀምጠዋቸዋል","ተሰንዝረዋል","ተሰንዝሯል",
"ተሰጥቶባቸዋል","ተሰጥቶበታል","ተናገር","ያመራል","ተገምቷል","ተቆጥሯል","አልፏል",
"ተነግሯል","አይታወቁም","ተገኝተዋል","ተከናወን","ሰጥተውበታል","ተከሰት","ይለያያል",
"ተሠርተዋል","አልደመደምንም","አንችልም","ተይዟል","ይኼንንም","ተብሏል","ተይቀዋል",
"ተሰምተዋል","አልቀረቡም","አይገባም","እ.ኤ.አ.","ተረገጥ","ሄደዋል","ይጠቀማል",
"ይሠራጫል","ከላይ","አዳራሽ","አጥፍ","ተወቅሰዋል","አልተካተተም","ተጠናቅሯል",
"አጥተናል","ገልጸውላቸዋል","አልሰጡንም","አልተመለከትንም","አልነበረበትም","ይመልስ","ይነሳል",
"ተሞክሯል","ይጠጋል","ይባላል","ይገልጸዋል","ተንትነዋል","አልተገኝም","ርቸል",
"ተነስቷል","ተዘዋውረዋል","እሳቸውም","ተሾም","ተነስተዋል","ሾመዋል","ተረክበዋል",
"ተሹመዋል","ይገኙባቸዋል","ተመሥርቷል","አሳውቋል","ይፈታል","ተወያይተናል","እናምናል",
"ተወያይተንባቸዋል","ተማምረዋል","አልተገለጸም","ይጨምራል","ጥቂት","ያለፍ","ይከብዳል",
"ውሳን","ችሎት","አስተርጓም","ጀምረዋል","አስነብቧል","አቅታል","ተንገላቷል",
"ይደበድባል","አስይዘዋል","ተመሥርቶበታል","መስክረዋል","አጠቃለዋል","ታልፏል","ቀርባቸዋል",
"ተነግሯቸዋል","ዘልፈዋል","ተሰጥቷቸዋል","ያመለከታል","አይተወቁም","ይመከራል","አልፈዋል",
"አብዛኝ","ከአት","ተመርቷል","መርጠዋል","ያደረጉት","አላበቃም","አነጋግረዋል",
"ተወያይቷል","ማንኛውም","ይቀጣል","አፅድቋል","ንብረትነታች","አሰምቷል","አምጥቷል",
"ወጥቷል","ያከናውናል","አይፈቀድላቸውም","ይደመጣል","ይከላከላል","ክርክራች","አይስማሙበትም",
"አንድም","ተገዷል","አደርጋል","አስጠንቅቀዋል","ብሎታል","አሞግሷል","እጠብቃለሁም",
"ሰጠዋል","አይታል","አንፀባርቃል","አልተቀበለውም","ይቆጠርባቸዋል","ተበትኗል","ተለምድ",
"ይኖሩታል","አይከለከልም","ተለያይተዋል","ቀጥሏል","ተቃውመውታል","ውዝግብ","ያውቀዋል",
"ይወርዳል","እወዳል","አላደረገም","ወስናል","አይመረምርም","አያስፈልግም","አንሄድም",
"አስነስ","ራሳች","እርሽ","አርስ","ታቅዷል","ተሰብስቧል","አስቀምጧል",
"አባላት","ይጥልባቸዋል","አይረሳም","ይጀምራል","አልተቻም","አድርሰውታል","አሉም",
"አልተሞከረም","አውግዘውታል","ፈጅቶበታል","ተረክቧል","አሳዝናል","አልተቀበለችም","አሟልቷል",
"ፈርሰዋል","አልቀረበበትም","ተሰጥተዋል","ተደርሶበታል","ሚቀጥሉት","ያገኛል","አቋርጠዋል",
"ተቀምጧል","አልተገለጹም","ይገባናል","ነበራች","አልገቡም","ይሞግታል","ይደመድማል",
"አትተዋል","ልማታው","ያትታል","ማከልም","ይኖረዋል","ጥገኝ","ይደርሳል",
"ሠርቷል","ይህንንም","አልነበራቸውም","አቅርበዋቸዋል","አልተፈጠረም","አብቅቷል","አካሂደዋል",
"አራምደዋል","ተወስተዋል","አስተየት","ወድቀዋል","ቀርቦበታል","ሌሎችም","ተወስኖባቸዋል",
"አሰቃቅ","አያይዘውም","አልሰጡም","አስቀምጦታል","አግኝታል","አስረድታል","ታብራራል",
"ተናግራል","ቢገለጹም","ያነሱት","ተሰጣች","ተስተጓጉለዋል","ይፈጠራል","ተስምቶኛል",
"ሆኖኛል","ሠርተናል","ሞክረናል","መለከታች","አይፈቅድም","ቢሆንም","አነጋግሯቸዋል",
"ስ","ይወሳል","መርጧል","ግምገም","ገድቧቸዋል","አፀደቅ","ተቃውም",
"አላስረዳም","አልተቆጠቡም","ተረጋግቷል","ተሰብከዋል","እናውቃል","አንልም","አጠናቀቅ",
"ተጠናቀቅ","አቋረጥ","ተመሥርቶባቸዋል","ይኮንናል","ተጫውቷል","ይወሰናል","ያደርገዋል",
"ይጭራል","","ጽፏል","","አጥቷል","ትጠቀማል","ይጠፋዋል","ጠይቀዋል","ብለዋል",
"አውቀዋል","አልገታም","ታገለግል","አልወሰደችም","አልመጡም","አልፈቱም","አያሳየንም",
"ይገርመኛል","ገምተዋል","ምትወግን","ትጎራበታል","አምርተዋል","ተሻሽሏል","አስተባብሏል","ትናንት", "ነው","ጥቂት", "በርካታ", "ብቻ", "ሁሉም", "ሌላ", "ሌሎች", "ሁሉ", "እያንዳንዱ", "እያንዳንዳችው", "እያንዳንዷ", "እንደገና", "ማንም", "እባኩዎ",
"እባክ", "ተጨማሪ", "ሰአት", "ውጪ", "ነበሩ", "ነበረች","ወይዘሮ", "ወይዘሪት", "ነገሮች", "ከፊት", "ከላይ", "ከታች"
,"በታች", "የታች", "ውስጥ", "ሆላ" ,"መካከል", "ሰሞኑን", "የጋራ", "ከጋራ", "ተለያዩ", "ተለያየ", "ድረስ", "እስከ", "በጣም", "ግን", "ሲሆን",
"ሲል", "ውስጥ", "ላይ", "ነው", "ጋር", "ናቸው", "ይህ", "በላይ", "ወደ", "ወዘተ", "እና", "ወይም", "እንደ", "አቶ", "ፊት", "ወደፊት" ,"ነገር", "በፊት",
"በሆላ", "በኩል", "ስለ", "ደግሞ", "እንጂ", "እንዲሁም", "ነው", "ነበር", "ነበረ",  
"ወይም", "እዚህ", "ሌላ", "እባክሸ", "እዚያ", "ሌሎች", "እባክህ", "ሁሉ", "ተጨማሪ", "ናቸው", "እያንዳንዱ", "ውጪ", "እያንዳንዳችው", "እንዲሁም", "ነበሩ", "ነበረች",
"ማንም", "ሁሉም", "እባክዎ", "ነገሮች", "ከፊት", "ከላይ", "ከታች", "የታች", "ገልፀዋል","ተብሏል",
"ውስጥ", "ኋላ", "ከኋላ", "መካከል", "ሰሞኑ", "ጋራ", "ተለያዩ", "ተለያየ", "ተብሏል", "ድረስ", "እስከ", "በጣም", "ግን", "ሲሆን","ሲል", "ውስጥ", "ላይ",
"ነው", "ጋር", "ይህ", "ወደ", "ወዘተ", "እና", "ወይም", "ወደፊት", "ያለው", "ነገር", "በኋላ", "በኩል", "ደግሞ", "እንጂ", "በዚህ", "ሆኖ", "ልዩ", "ጊዜ", "ዜና"};
    public final static Set<String> Ammharic_stopword_list = new HashSet<String>();

    StopwordRemoval() {
        this.Ammharic_stopword_list.addAll(Arrays.asList(AMHARIC_STOPWORD));       
    }
     public String checkDB(String term){
          String val;
       String jdbcUrl = "jdbc:postgresql://localhost:5432/EncyclopidicKnowledge";
    String username = "postgres";
    String password = "abushay";
    String st12="";
    Connection conn = null;
    Statement stmt = null;
     Statement stm = null;
    ResultSet rs = null;
     ResultSet rs1 = null;
            try {
      // Step 1 - Load driver
     // Class.forName("org.postgresql.Driver"); // Class.forName() is not needed since JDBC 4.0
      // Step 2 - Open connection
      conn = DriverManager.getConnection(jdbcUrl, username, password);
      // Step 3 - Execute statement
         String selste= "SELECT * FROM public.\"RelatedLink\";";
       //  String selst= "SELECT * FROM public.\"category\";";
      stmt = conn.createStatement();
     // stm = conn.createStatement();
      rs = stmt.executeQuery(selste);
       // System.out.println(d.Stem("ሰዎች"));
       while(rs1.next()) {
           
      //  System.out.println(rs.getString(2));
      
         Integer x2=rs.getInt(1);
          //  System.out.println("="+x);
//        String x2=x.toString()+".";
//           // System.out.println(x2);
         st12=rs1.getString(2);
//     
         if(st12.equalsIgnoreCase(term)){
             val="true";
             break;
         }
         
       }
            }
        catch (SQLException e) {
      e.printStackTrace();
    } 
    
    finally {
      try {
        // Step 5 Close connection
        if (stmt != null) {
          stmt.close();
        }
        if (rs != null) {
          rs.close();
        }
        if (conn != null) {
          conn.close();
        }
      }
      
      catch (Exception e) {
        e.printStackTrace();
      }
    }
       
          return "true";
      }

    public List removeStopList(List tokens) {
        String [] resultAfter=null;
        int k=0;
        List tokensWithOutStopWord = new ArrayList<>();
        Set<String> stopwords = Ammharic_stopword_list;
        String stopword=Arrays.toString(AMHARIC_STOPWORD);
      //  System.out.println("size="+stopwords.size());
//       for(String x:stopwords){
//        System.out.println("-"+x);
//    }
//         for (int i =0; i < tokens.size(); i++){
//             for (int j =0; j < AMHARIC_STOPWORDS.length; i++){
//            String res = (String) tokensWithOutStopWord.get(i); 
//             String res2 =AMHARIC_STOPWORDS[j] ; 
//             if (res.contains(res2))
//                 continue;
//             else {
//            resultAfter[k]=res;
//                 System.out.println("res"+k+"="+ resultAfter[k]);
//            k++;
//           //   System.out.println("t="+t);
//            
//                 }  
//        }
//         }
        for (Object t : tokens) {
        //    System.out.println("t="+t);
            String h=t.toString().trim();
            if (stopword.contains(h)) {
             //  System.out.println("t="+t);
                continue;
            }
            else{
             // System.out.println("t="+t);   
            tokensWithOutStopWord.add(t);
           //   System.out.println("t="+t);
            }
        }
        return tokensWithOutStopWord;
    }
    
    public static void arrangeStopW(){
          String [] resultAfter=null;
        int k=0;
        List tokensWithOutStopWord = new ArrayList<>();
        Set<String> stopwords = Ammharic_stopword_list;
        String stopword=Arrays.toString(AMHARIC_STOPWORD);
      for (int i=0;i<AMHARIC_STOPWORD.length;i+=6){
          System.out.println("+"+'"'+AMHARIC_STOPWORD[i]+" "+AMHARIC_STOPWORD[i+1]+" "+AMHARIC_STOPWORD[i+2]+" "+AMHARIC_STOPWORD[i+3]+" "+AMHARIC_STOPWORD[i+4]+" "+AMHARIC_STOPWORD[i+5]+" "+'"');
      }  
      
   
         
    }
    
 public static void main(String[] args) throws Exception
    {
      StopwordRemoval st=new StopwordRemoval();
  st.arrangeStopW();
    }   

}
