/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package textpreprocessing;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.HashSet;
import java.util.Iterator;
import java.util.List;
import java.util.Set;

public class StopwordRemove {

    private static final String AMHARIC_STOPWORDS
            = "ነው ነበር ነበረ አወ  እና  ወይም እዚህ ሌላ  እባክሸ እዚያ ሌሎች እባክህ ከ ሁሉ ተጨማሪ ናቸው እያንዳንዱ ውጪ ትናንት እያንዳንዳችው ናት ጥቂት "
            + "እንዲሁም ነበሩ በርካታ እንደገና ነበረች ብቻ ማንም ያ ሁሉም እባክዎ ነገሮች ከፊት ከላይ ታች ከታች በታች የታች "
            + "ከውስጥ በውስጥ የውስጥ ኋላ ከኋላ መካከል ከመካከል ሰሞኑን ከሰሞኑ በሰሞኑ የሰሞኑ ጋራ የጋራ ከጋራ ተለያዩ ተለያየ "
            + "ድረስ እስከ በጣም ግን ሲሆን ሲል ውስጥ ላይ ነይ ነው ጋር ናቸው ይህ ወደ ወዘተ እና ወይም እንደ ፊት ወደፊት "
            + "ነገር በኋላ በኩል ስለ ደግሞ እንጂ በዚህ ሆኖ ልዩ ጊዜ ዜና "
            +"﻿ይኼ ሆነም አፅድቆታል አይከትም እስክ ያወሳል "
            +"ይስማሙበታል ምሳል ያሳያል መሆኑም ምናልባትም ይገምታል "
            +"ያነሳል ይጠቅሳል ከፍተኝ ተረጋግ ይተነብያል ይቻላል "
            +"ያምናል ያሳስባል ተስፍ ሪፖርተር ኃላፍ ተጠየቅ "
            +"ይገባል ዘም አስረድቷል አስታውሷል ዚህ መግለጭ "
            +"ተካቷል ተብራርቷል ተመልክቷል አስተላልፏል ተፈቀድ ተጫውታል "
            +"ትገኛል አድርጋል ተጫዋታል ይገኛል ቀጥፏል ተፈጥሯል "
            +"ይታያል ተቀይረዋል ተስተጓጉሏል ጠፍቷል ተገትቷል አጋጥሟል "
            +"ትፈልጋል ገብታል ትኮንናል ይከራከራል ብል ይጠቀምብሃል "
            +"ሆናል ያባብሱታል ይኼ ኖርን አለብ ሁለት "
            +"አመራር አጠናቋል ጠናቀቅ ምሥረት ጀምሯል ተካሄድ "
            +"ተቀመጥ አውስቷል ተተክ ያደርጋል ካቲት ሸኝቷል "
            +"ሰንብቷል አስተባብሯል ተናፈስ ተስተውለዋል ወደብ አብራርቷል "
            +"አንፀባርቀዋል ርበር ይጠቁማል ተሰናበት ይሆናል ይሠራሉም "
            +"ይግ ያገለግላል ተችተዋቸዋል ተወስቷል ይተቻል ጆርጅ "
            +"ተገኝቷል ገዥ ስብሰብ ያቀርባል ተዘርዝሯል ይመርጣል "
            +"ባለፍ ተበተን ታወቁት ተደንግጓል አልተያዘም ሁም "
            +"ያሳስበዋል በተለያይ እስከዛር አልሆነም አድርጎታል ደርሰዋል "
            +"ቀሩት አዋጅ አንድ ሸሽተዋል ተገድደዋል ተሰደዋል "
            +"እሳች ገለጽ ተበሩት አሰምተዋል ተሰናብተዋል ብሏቸዋል "
            +"ተብለዋል አክሏል ዓቃብ አስፍሯል አስጠነቀቅ አስጠንቅቋል "
            +"መልሷል አላገኙም ተሰጥቷል ይደረጋል አድንቀዋል ተፈት "
            +"ተለቋል ተቃጥለዋል አወዛጋብ ሰጥተውታል ፈጅቷል መክረዋል "
            +"ዝግ ገነዘባል አላብራሩም ግፋል ዶ/ር ያመላክታል "
            +"ተስማምተዋል ተፈጽሟል ሰንብታል አሥር አልተገኘም አውጇል "
            +"ተዘግተዋል ተቋርጧል ሆኗል አይስማሙም መጥታል ደርሳል "
            +"ታደርጋል ምንል ያተኩራል ይፈልጋል ሰምተናል ይመጣል "
            +"መብት ክትትል ማናቸውንም አሁን ሰብሳብ አካቷል "
            +"አልቀረበም ተደርገዋል ተዘጋጅቷል ይኖርበታል ተጠርተዋል ይህ "
            +"ይስተዋላል ተደርሷል አልበረደም አስከትሏል ሞተዋል አወጥ "
            +"ሰፍኗል አስተለፍ ዓም ልዩነታች መጀመርይ ይገኝበታል "
            +"አስታወቅ አለፉም አጠናቀዋል ሌል ገምግሟል አውጥቷል "
            +"ቀጥለዋል አድረዋል ብአድ አስተማሪነት አናስብም ይመራል "
            +"አት ወስነናል አያምኑም ይሾማል ይሰጣቸዋል ይሰማል "
            +"ይደነግጋል ሰሞን ያካሂዳል አትቷል አራት አምስት "
            +"ሰባት ይወደራል መርጧቸዋል ማብራሪይ ተቃውመዋል ቀረቡት "
            +"አልተቀበሉትም ተገብቷል ድምፅ ተመልሰዋል ሰላስ ተቆጥረዋል "
            +"ተጥሏል ይዟል ያውላል ይቋቋማል ተገደዋል አይገምቱም "
            +"ችል ተጀምሯል ጽፈናል ሞግተዋል መልሳት አሉብ "
            +"ተከራክረዋል ይጠይቃል አላየሁም አልሰማሁም አህ ዘርዝረዋል "
            +"አላሰማም ተሰጥታል ሠጋል መጨረሻም ነግረዋቸዋል ይቀጥላል "
            +"ከሰኝ ነግረዋል አውጥተዋል ተቃውማል ተቃውሞታል ተቃውሟል "
            +"ተዘግቷል መጥተዋል ተቋርጠዋልታንታለም ተያያዝ አደርጓል ሪፖርት "
            +"ትናገራል ታስታውሳል ታስረዳል ባለፉት ትገልጻል ታስረድታል "
            +"አስገብተዋል አልችልም አናስታውስም አይመጣም አይኖርም አይመስለኝም "
            +"ይኖራል ማይቻል ነበር ሆኗልም ከሁል አይችልም "
            +"ይኖርብናል ተንፀባርቀዋል አላቆሙም ያቀረቡት ያሰፋል አንፈልግም "
            +"አልታየም ቀጥል ተቋረጥ ርሟል እስር ነኝ "
            +"አያውቅም ተቀይሯል አምኗል ያደንቅለታል ይወስዳል አጠቃላይ "
            +"ተርዟል ታዝቧል ትናንት ቆሟል ተቃጥሏል ይሰነብታል "
            +"ፍቱል ከጅም ተጠቅሟል አድርገናል ጋምቤል አሳልፋል "
            +"መደበኝ ተፈጠር አሰል ገጥሟል አስተለፈዋል ተነስ "
            +"ስምምነት ሰፍሯል ወረድ ይሸፍናል ይዋሰናል አጥተዋል "
            +"ይጠቀሳል ተንት አስምሮበታል አስተሰብ ውስጥ ይቋረጣል "
            +"ቆጠር የት ተፈቅዶላቸዋል ተካሂዷል ተዘጉት ይለቃል "
            +"አልተጠቀሙበትም ቀበላቸዋል ሁለቱም ጉባዔ ተለይተዋል ተለቀቅ "
            +"ተለቀዋል ቢል ጥያቅ ተቋርጥ ሃምስ እምነበረድ "
            +"ይፈቀድላቸዋል ከጎድ መረት ነን ተዛብቷል ይፈጥራል "
            +"አምነዋል ይሠራል ነግረውናል ይገለጻል አካሂዷል ያሳልፋል "
            +"ካለፉት ወራት ቀድሞውም ይሰጣል አይችሉም ይላል "
            +"አሳለፍ ተቋቁሟል አስገኝቷል ሰጥተዋቸዋል ቆዩት ብለውታል "
            +"ይሰማበታል ተሰምሮበታል ተመላክቷል ይዘረዝራል አፍርሰናል እወስዳል "
            +"እናርማል አረጋግጧል ሰጥቶኛል አልሄድም እቆጠረዋል ተቸግራል "
            +"ይከፍታል ተናገረዋል አልጠቆሙም አሰኝቷል እስካሁንም ወቅሰዋል "
            +"ላቸውም ይውላል መጥቷል ተወሰን ላትም ይገጥሙናል "
            +"ተፈራርመዋል ዘለቅ አውግዟል ምክንያታች አያስከትልም አስይዟል "
            +"ተንትኗል አድርገውለታል ዘግበዋል አልተጀመረም ቻሉት መርተውታል "
            +"ተመዝግበዋል አስገንዝበዋል ማጠቃለይ መዝጊይ ሸጦታል ይናገራል "
            +"ፕል አስቁሟል ቋም መድቧል አቀረብ ነው "
            +"አቅርበዋል አሳስቧል አቅርቧል አድርገዋል ተገልጿል አስታውቀዋል "
            +"ከዝ ጠቁመዋል ተናግረዋል ሰጥተዋል ተደርጓል ተችሏል "
            +"ታውቋል ወ/ር ገልጸዋል አረጋግጠዋል አስረድተዋል አክለዋል "
            +"ውጭ ያመለክታል ብሏል ጠቁሟል ተጠቁሟል ተጠቅሷል "
            +"አስታውቋል አንስተዋል ይችላል አድርጓል ተካተዋል ቀርተዋል "
            +"ይታወቃል ይታወሳል ይነገራል አልተሳካም ተስተውሏል አይዘነጋም "
            +"አልተቻለም ይስማማል አስታውሰዋል ቀድም ይመስለኛል ተደምጧል "
            +"ቆይተዋል ይገልጻል አልቻለም ተመሳሳይ አይደለም ዘግቧል "
            +"አሳስበዋል አሳልፏል ተናግሯል ተመሠረት ያብራራል ቀርቷል "
            +"ተፈትተዋል መቀጠልም ተሰምቷል ገጥሟቸዋል ታይተዋል አስተላልፈዋል "
            +"ተከስተዋል ተዳርገዋል ተፈናቅለዋል አመልክተዋል አስቆጥሯል ተደምጠዋል "
            +"ነገር አውስተዋል ቀርቧል እን ተወስኗል ጠይቀዋል "
            +"አመልክቷል ተጠቆም ይጠበቃል ዋን አስፍረዋል ቀደም "
            +"አልታወቀም ጠቅሰዋል ቀርበዋል ነች ጠይቋል ቆይቷል "
            +"አራተኝ ይመስላል ይመለከታል አግኝተዋል ተጨማሪም ተረጋግጧል "
            +"ተቆጥበዋል አብራርተዋል አገልግለዋል አንዳንድ ዳሰዋል አልተገኙም "
            +"አይታወቅም ተችተዋል ደርሶበታል ተለይም ሁለተኝ ሦስተኝ "
            +"ያክላል ታይቷል ተጠናቋል ተገለጽ ይገኙበታል አንደኛውም "
            +"ይዘወራል ታጣል ይወክላል ይሞክራል አልፈቀዱም አልደረሱም "
            +"አላገኘም ቀርታል ተወያይተዋል አልጀመሩም ያጋጠም ተጀመር "
            +"ደርሶባቸዋል ጋይተዋል ወድመዋል አሁንም አልሰጠንም አይኖርምም "
            +"ፈቅዷል አሳይተዋል አላውቅም አይነካቸውም ተከስት ውክል "
            +"ፍተዋል ሰጥቷቸዋል አይደሉም አጣጥለውታል አትችልም አይቻልም "
            +"አለፍ ተጠቅመዋል ይካሄዳል ተሳትፈዋል ተልከዋል ተምራል "
            +"አመለከት አልተጠናቀቀም ቆይታል አልቻሉም አድርጋዋል አይቀበሉትም "
            +"ተጨማር ተጥሎባቸዋል ተደግፏል ሆኖም አልነበረውም ተገምግሟል "
            +"አሉት አሳይቷል አገልግሎት አልነበረም ባይሆንም አላስብም "
            +"አይኖረውም ወስደዋል አልነበሩም ይከሳል ያሉት ገጥሞታል "
            +"ያሠጋል ይህንን አድርገውላቸዋል አትገባም ተዘግቧል አንፈቅድም "
            +"አይቀርብም አይድኑም አረጋጋጠዋል ሆነዋል ወስዷል አደረግ "
            +"አድርጓቸዋል ተደራዳር ባቸውም ከፀር ይቀርባል ቀምጣል "
            +"ሻሻል ሰንዝረዋል አስተባብለዋል አሳስባል ያከራዩታል ይመሠርታል "
            +"ተላልፋል አስቀምጠዋቸዋል ተሰንዝረዋል ተሰንዝሯል ተሰጥቶባቸዋል ተሰጥቶበታል "
            +"ተናገር ያመራል ተገምቷል ተቆጥሯል አልፏል ተነግሯል "
            +"አይታወቁም ተገኝተዋል ተከናወን ሰጥተውበታል ተከሰት ይለያያል "
            +"ተሠርተዋል አልደመደምንም አንችልም ተይዟል ይኼንንም ተብሏል "
            +"ተይቀዋል ተሰምተዋል አልቀረቡም አይገባም እ.ኤ.አ. ተረገጥ "
            +"ሄደዋል ይጠቀማል ይሠራጫል ከላይ አዳራሽ አጥፍ "
            +"ተወቅሰዋል አልተካተተም ተጠናቅሯል አጥተናል ገልጸውላቸዋል አልሰጡንም "
            +"አልተመለከትንም አልነበረበትም ይመልስ ይነሳል ተሞክሯል ይጠጋል "
            +"ይባላል ይገልጸዋል ተንትነዋል አልተገኝም ርቸል ተነስቷል "
            +"ተዘዋውረዋል እሳቸውም ተሾም ተነስተዋል ሾመዋል ተረክበዋል "
            +"ተሹመዋል ይገኙባቸዋል ተመሥርቷል አሳውቋል ይፈታል ተወያይተናል "
            +"እናምናል ተወያይተንባቸዋል ተማምረዋል አልተገለጸም ይጨምራል ጥቂት "
            +"ያለፍ ይከብዳል ውሳን ችሎት አስተርጓም ጀምረዋል "
            +"አስነብቧል አቅታል ተንገላቷል ይደበድባል አስይዘዋል ተመሥርቶበታል "
            +"መስክረዋል አጠቃለዋል ታልፏል ቀርባቸዋል ተነግሯቸዋል ዘልፈዋል "
            +"ተሰጥቷቸዋል ያመለከታል አይተወቁም ይመከራል አልፈዋል አብዛኝ "
            +"ከአት ተመርቷል መርጠዋል ያደረጉት አላበቃም አነጋግረዋል "
            +"ተወያይቷል ማንኛውም ይቀጣል አፅድቋል ንብረትነታች አሰምቷል "
            +"አምጥቷል ወጥቷል ያከናውናል አይፈቀድላቸውም ይደመጣል ይከላከላል "
            +"ክርክራች አይስማሙበትም አንድም ተገዷል አደርጋል አስጠንቅቀዋል "
            +"ብሎታል አሞግሷል እጠብቃለሁም ሰጠዋል አይታል አንፀባርቃል "
            +"አልተቀበለውም ይቆጠርባቸዋል ተበትኗል ተለምድ ይኖሩታል አይከለከልም "
            +"ተለያይተዋል ቀጥሏል ተቃውመውታል ውዝግብ ያውቀዋል ይወርዳል "
            +"እወዳል አላደረገም ወስናል አይመረምርም አያስፈልግም አንሄድም "
            +"አስነስ ራሳች እርሽ አርስ ታቅዷል ተሰብስቧል "
            +"አስቀምጧል አባላት ይጥልባቸዋል አይረሳም ይጀምራል አልተቻም "
            +"አድርሰውታል አሉም አልተሞከረም አውግዘውታል ፈጅቶበታል ተረክቧል "
            +"አሳዝናል አልተቀበለችም አሟልቷል ፈርሰዋል አልቀረበበትም ተሰጥተዋል "
            +"ተደርሶበታል ሚቀጥሉት ያገኛል አቋርጠዋል ተቀምጧል አልተገለጹም "
            +"ይገባናል ነበራች አልገቡም ይሞግታል ይደመድማል አትተዋል "
            +"ልማታው ያትታል ማከልም ይኖረዋል ጥገኝ ይደርሳል "
            +"ሠርቷል ይህንንም አልነበራቸውም አቅርበዋቸዋል አልተፈጠረም አብቅቷል "
            +"አካሂደዋል አራምደዋል ተወስተዋል አስተየት ወድቀዋል ቀርቦበታል "
            +"ሌሎችም ተወስኖባቸዋል አሰቃቅ አያይዘውም አልሰጡም አስቀምጦታል "
            +"አግኝታል አስረድታል ታብራራል ተናግራል ቢገለጹም ያነሱት "
            +"ተሰጣች ተስተጓጉለዋል ይፈጠራል ተስምቶኛል ሆኖኛል ሠርተናል "
            +"ሞክረናል መለከታች አይፈቅድም ቢሆንም አነጋግሯቸዋል ስ "
            +"ይወሳል መርጧል ግምገም ገድቧቸዋል አፀደቅ ተቃውም "
            +"አላስረዳም አልተቆጠቡም ተረጋግቷል ተሰብከዋል እናውቃል አንልም "
            +"አጠናቀቅ ተጠናቀቅ አቋረጥ ተመሥርቶባቸዋል ይኮንናል ተጫውቷል "
            +"ይወሰናል ያደርገዋል ይጭራል  ጽፏል  "
            +"አጥቷል ትጠቀማል ይጠፋዋል ጠይቀዋል ብለዋል አውቀዋል "
            +"አልገታም ታገለግል አልወሰደችም አልመጡም አልፈቱም አያሳየንም "
            +"ይገርመኛል ገምተዋል ምትወግን ትጎራበታል አምርተዋል ተሻሽሏል "
            +"አስተባብሏል ትናንት ነው ጥቂት በርካታ ብቻ "
            +"ሁሉም ሌላ ሌሎች ሁሉ እያንዳንዱ እያንዳንዳችው "
            +"እያንዳንዷ እንደገና ማንም እባኩዎ እባክ ተጨማሪ "
            +"ሰአት ውጪ ነበሩ ነበረች ወይዘሮ ወይዘሪት "
            +"ነገሮች ከፊት ከላይ ከታች በታች የታች "
            +"ውስጥ ሆላ መካከል ሰሞኑን የጋራ ከጋራ "
            +"ተለያዩ ተለያየ ድረስ እስከ በጣም ግን "
            +"ሲሆን ሲል ውስጥ ላይ ነው ጋር "
            +"ናቸው ይህ በላይ ወደ ወዘተ እና "
            +"ወይም እንደ አቶ ፊት ወደፊት ነገር "
            +"በፊት በሆላ በኩል ስለ ደግሞ እንጂ "
            +"እንዲሁም ነው ነበር ነበረ ወይም እዚህ "
            +"ሌላ እባክሸ እዚያ ሌሎች እባክህ ሁሉ "
            +"ተጨማሪ ናቸው እያንዳንዱ ውጪ እያንዳንዳችው እንዲሁም "
            +"ነበሩ ነበረች ማንም ሁሉም እባክዎ ነገሮች "
            +"ከፊት ከላይ ከታች የታች ገልፀዋል ተብሏል "
            +"ውስጥ ኋላ ከኋላ መካከል ሰሞኑ ጋራ "
            +"ተለያዩ ተለያየ ተብሏል ድረስ እስከ በጣም "
            +"ግን ሲሆን ሲል ውስጥ ላይ ነው "
            +"ጋር ይህ ወደ ወዘተ እና ወይም "
            +"ወደፊት ያለው ነገር በኋላ በኩል ደግሞ "
            +"እንጂ በዚህ ሆኖ ልዩ ጊዜ ዜና "
            +"ሁሉ ሆነ ሆነህ ሆነው ሆኑ ሆና ሆንሁ ሆይ ለማንም ለምን ለዚህ ሊሆን ላሉ ላይ ሳለ ሳይሆን ስለ ስለዚህ ስለዚህም በሆነ በኋላ በላይ በሌላ "
            +"በምን በርሳቸው በእነዚህ በዚህም በዚያ በዚያም  በዚያው ቢሆን ቢኖር ባሉ ብላችሁ ታውቃላችሁ ትሆን  "
            +"ነህ ነበረ ነን ነኝ አለች አለኝ አለው አሉ አሉት አሉአቸው አላ አላቸው አንተ አይደለምን አደረገ እላችኋለሁ "
            +"እስከ እርሱም እነሆ እነሆም እነዚህም እነዚህን እነዚህንም እነዚያም እናንተ እኔ እንኳ እንደ እንደሆነ እንደዚህ እንዲሁ "
            +"እንዲህ እንዲሆን እንጂ እንግዲህ እጅግ ከላይ ከእነዚህ ከዚያ ወይም "
            +"ወደ ወደዚህ ወዲህ ውስጥ ዘንድ የሆነውን የለም ያለ ይሁን ይህ ይላል "
            +"አመቻችተዋል አታደርግም አረጋግጠውላቸዋል አክብረዋል";

    public static final Set<String> Ammharic_stopword_list = new HashSet<String>();

   public StopwordRemove() {
        this.Ammharic_stopword_list.addAll(Arrays.asList(AMHARIC_STOPWORDS.trim().split(" ")));

    }

    public List removeStopWord(List tokens) {
        List tokensWithOutStopWord = new ArrayList<>();
        Set<String> stopwords = Ammharic_stopword_list;
        for (Object t : tokens) {
            if (stopwords.contains(t)) {
                continue;
            }
            else if (t.toString().length()<2) {
                continue;
            }
            tokensWithOutStopWord.add(t);
        }
        return tokensWithOutStopWord;
    }
public static void main(String[] args){
    String str="";
    StopwordRemove s=new StopwordRemove();
    Set<String> stopwords = Ammharic_stopword_list;
   
    Iterator iterator = stopwords.iterator();
    int i=0;
    while(iterator.hasNext()){
  String element = (String) iterator.next();
  
       // System.out.println(str);
  
  if(!str.contains(element)){
  System.out.print(element+" ");
  i++;
}
   str=str+element;
    }
    System.out.println("i="+i);
   
}
}